Сравнитель/src/Documents/СравнениеДанных/СравнениеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СравнениеДанных</name>
  <registerRecords>InformationRegister.СравненияДанных</registerRecords>
  <attributes>
    <name>ПравилоСравненияДанных</name>
    <type>
      <types>CatalogRef.ПравилаСравненияДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВыгрузки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументаСравнениеДанных</types>
    </type>
  </attributes>
</mdclass:Document>

Сравнитель/src/InformationRegisters/ВыгрузкиДанных/ВыгрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыгрузкиДанных</name>
  <resources>
    <name>Выгрузка</name>
    <comment>Содержит строку. Хранилище следует максимально сжимать</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.СравнениеДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>База</name>
    <type>
      <types>EnumRef.НомераБаз</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Сравнитель/src/Enums/СтатусыДокументаСравнениеДанных/СтатусыДокументаСравнениеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументаСравнениеДанных</name>
  <enumValues>
    <name>ОжидаетсяВыгрузкаИзДругойБазы</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяСравнение</name>
  </enumValues>
  <enumValues>
    <name>ВыполняетсяСравнение</name>
  </enumValues>
  <enumValues>
    <name>СравнениеЗавершено</name>
  </enumValues>
  <enumValues>
    <name>СравнениеОтменено</name>
  </enumValues>
</mdclass:Enum>

Сравнитель/src/Documents/СравнениеДанных/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеДокументов.СоздатьИЗаписатьДвиженияПриПроведении(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеДокументов.УдалитьВсеДвиженияОбъекта(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСтатус() Экспорт
	Если Статус = Перечисления.СтатусыДокументаСравнениеДанных.ВыполняетсяСравнение Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыДокументаСравнениеДанных.СравнениеЗавершено Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыДокументаСравнениеДанных.СравнениеОтменено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыгрузкиДанных.База КАК База
		|ИЗ
		|	РегистрСведений.ВыгрузкиДанных КАК ВыгрузкиДанных
		|ГДЕ
		|	ВыгрузкиДанных.Документ = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() <= 1 Тогда
		Статус = Перечисления.СтатусыДокументаСравнениеДанных.ОжидаетсяВыгрузкаИзДругойБазы;
	Иначе
		Статус = Перечисления.СтатусыДокументаСравнениеДанных.ОжидаетсяСравнение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
